{
    general: {
        enabled: true,

        // Enables verbose logging for debugging.
        debug: false,
    },

    raidTimes: {
        // Override raid times for all locations, ignoring custom times set for individual locations.
        overrideAll: false,

        // Override raid times options. Used for all maps, but only when the above `override_all` is set to `true`.
        //
        // These are examples of how to use the various options; only a single minutes and weight object is required.
        // If more than one option is provided, the weights are used to determine how often each object is used. The
        // higher the weight, the more often it is used relative to the others.
        //
        // The minutes and weight options can be a single number, or an object with min and max values which will be
        // used to generate a random number between the two.
        override: [
            { minutes: 60, weight: 10 }, // 60 minute raid, used 10 times more often than a weight of 1.
            { minutes: 30, weight: { min: 2, max: 5 } }, // 30 minute raid, used 2-5 times more often than a weight of 1.
            { minutes: { min: 15, max: 20 }, weight: 1 }, // 15-20 minute raid, used as often as any other weight of 1.
        ],

        // Custom raid times for specific locations. Used when `override_all` is set to `false`.
        // The option can be a number, or an object containing minutes and weight options as described above.
        customTimes: {
            customs: 40,
            factoryDay: 20,
            factoryNight: 25,
            interchange: 40,
            laboratory: 35,
            lighthouse: 40,
            reserve: 40,
            shoreline: 45,
            streets: 50,
            woods: 40,
        },
    },

    botSpawn: {
        // Adjust regular bot spawn waves, ensuring bots continue to spawn throughout longer raids.
        // You can leave this enabled with client-side mods that adjust bot spawns; the client-side mod changes
        // will always take priority.
        adjustWaves: true,

        // Maximum number of bots that can be alive at once. Reduce if performance issues arise.
        maximumBots: 28,

        // A wave is defined as a random number of bots that spawn at the same time at the same location.
        // The following settings control the number of waves that happen at once (per spawn group).
        wavesPerGroup: {
            max: 4,
            min: 1,
        },

        // A group is a collection of waves that happen in roughly the same time frame (but at different locations).
        // The following settings control the timing between groups.
        groupGapMinutes: {
            max: 8,
            min: 4,
        },
    },
}
